[M_Orchid_Wingman MissionDefinition]
MissionName="Cupido"
MissionDescription="Shade quer pedir a mão de uma mulher chamada Natalie em casamento. Infelizmente, ele perdeu o anel de noivado. Se você puder encontrá-lo e ajudar o Shade a pedir Natalie em casamento, você fará dele o necrófilo mais feliz de Pandora."
TurnInDescription="Natalie esnobou Shade... felizmente. Agradeça por você nunca ter que compartilhar uma lua de mel com ele."
MissionSummary="Ajude Shade a pedir a mão de Natalie."
MissionGiver="Shade"
MissionTurnInLocation="Shade"
TeaserText="Ajude um irmão."

[M_Orchid_Wingman:FindRing MissionObjectiveDefinition]
ProgressMessage="Pegue o anel de noivado"

[M_Orchid_Wingman:FindRingSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_Wingman:Propose MissionObjectiveDefinition]
ProgressMessage="Peça a mão de Natalie em casamento"

[M_Orchid_Wingman:ProposeSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_Wingman:ReturnToShadyDealer MissionObjectiveDefinition]
ProgressMessage="Volte até o Shade"

[M_Orchid_Wingman:ReturnToShadyDealerSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

